{
  "apple": "A round fruit with red or green skin and a white inside.",
  "application": "A formal request to an authority for something.",
  "apricot": "A juicy, soft fruit, resembling a small peach.",
  "banana": "A long curved fruit which grows in clusters and has soft pulpy flesh and yellow skin when ripe.",
  "backend": "The part of a software system that is not directly accessed by the user.",
  "bug": "An error, flaw or fault in a computer program.",
  "code": "Instructions for a computer, written in a programming language.",
  "computer": "An electronic device for storing and processing data.",
  "data": "Facts and statistics collected together for reference or analysis.",
  "debug": "The process of identifying and removing errors from computer hardware or software.",
  "frontend": "The part of a software system that is directly accessed by the user.",
  "java": "A high-level, class-based, object-oriented programming language.",
  "javascript": "A programming language that is one of the core technologies of the World Wide Web.",
  "server": "A computer or system that provides resources, data, services, or programs to other computers.",
  "spring": "A Java framework that makes it easy to create enterprise-grade applications.",
  "about": "Moving around; astir.",
  "above": "Heaven.",
  "accident": "An unexpected event with negative consequences occurring without the intention of the one suffering the consequences.",
  "account": "A registry of pecuniary transactions; a written or printed statement of business dealings or debts and credits, and also of other things subjected to a reckoning or review.",
  "achieve": "To succeed in something, now especially in academic performance.",
  "across": "(crosswords, often in combination) A word that runs horizontally in the completed puzzle grid or its associated clue.",
  "activity": "The state or quality of being active; activeness.",
  "actually": "(modal) In act or in fact; really; in truth; positively.",
  "address": "Direction.",
  "admit": "To allow to enter; to grant entrance (to), whether into a place, into the mind, or into consideration",
  "adult": "A fully grown human or animal.",
  "advance": "A forward move; improvement or progression.",
  "affect": "To influence or alter.",
  "afford": "To incur, stand, or bear without serious detriment, as an act which might under other circumstances be injurious;—with an auxiliary, as can, could, might, etc.; to be able or rich enough.",
  "afraid": "(usually used predicatively, not attributively, be afraid) Impressed with fear or apprehension; in fear.",
  "after": "Later; second (of two); next, following, subsequent",
  "against": "In a contrary direction to.",
  "agency": "The capacity, condition, or state of acting or of exerting power.",
  "agent": "One who exerts power, or has the power to act",
  "agree": "To harmonize in opinion, statement, or action; to be in unison or concord; to be or become united or consistent; to concur.",
  "agreement": "An understanding between entities to follow a specific course of conduct.",
  "ahead": "In or to the front; in advance; onward.",
  "alarm": "A summons to arms, as on the approach of an enemy.",
  "album": "A book specially designed to keep photographs, stamps, or autographs.",
  "alcohol": "Any of a class of organic compounds (such as ethanol) containing a hydroxyl functional group (-OH).",
  "allow": "To grant, give, admit, accord, afford, or yield; to let one have.",
  "almost": "Something or someone that doesn't quite make it.",
  "alone": "By oneself, solitary.",
  "along": "In company; together.",
  "already": "Prior to some specified time, either past, present, or future; by this time; previously.",
  "also": "(focus) In addition; besides; as well; further; too.",
  "although": "Though, even though, in spite of or despite the fact that: introducing a clause that expresses a concession.",
  "always": "At all times; throughout all time; since the beginning.",
  "amazing": "To fill with wonder and surprise; to astonish, astound, surprise or perplex.",
  "among": "Denotes a mingling or intermixing with distinct or separable objects. (See Usage Note at amidst.)",
  "amount": "The total, aggregate or sum of material (not applicable to discrete numbers or units or items in standard English).",
  "analysis": "Decomposition into components in order to study (a complex thing, concept, theory etc.).",
  "ancient": "A person who is very old.",
  "angel": "An incorporeal and sometimes divine messenger from a deity, or other divine entity, often depicted in art as a youthful winged figure in flowing robes.",
  "anger": "A strong feeling of displeasure, hostility or antagonism towards someone or something, usually combined with an urge to harm.",
  "animal": "In scientific usage, a multicellular organism that is usually mobile, whose cells are not encased in a rigid cell wall (distinguishing it from plants and fungi) and which derives energy solely from the consumption of other organisms (distinguishing it from plants).",
  "announce": "To give public notice, especially for the first time; to make known",
  "annual": "An annual publication; a book, periodical, journal, report, comic book, yearbook, etc., which is published serially once a year, which may or may not be in addition to regular weekly or monthly publication.",
  "another": "An additional one of the same kind.",
  "answer": "A response or reply; something said or done in reaction to a statement or question.",
  "anxiety": "An unpleasant state of mental uneasiness, nervousness, apprehension and obsession or concern about some uncertain event.",
  "anybody": "Any one out of an indefinite number of persons; anyone; any person.",
  "anyone": "Any person; anybody.",
  "anything": "Someone or something of importance.",
  "anyway": "Regardless; anyhow.",
  "anywhere": "In or at any location or an unknown location.",
  "apart": "(Used after a noun or in the predicate) Exceptional, distinct.",
  "appeal": "An application for the removal of a cause or suit from an inferior to a superior judge or court for re-examination or review.",
  "appear": "To come or be in sight; to be in view; to become visible.",
  "apply": "To lay or place; to put (one thing to another)",
  "approach": "The act of drawing near; a coming or advancing near.",
  "appropriate": "To make suitable; to suit.",
  "approve": "To sanction officially; to ratify; to confirm; to set as satisfactory.",
  "architect": "A professional who designs buildings or other structures, or who prepares plans and superintends construction.",
  "area": "A measure of the extent of a surface; it is measured in square units.",
  "argue": "To show grounds for concluding (that); to indicate, imply.",
  "argument": "A fact or statement used to support a proposition; a reason.",
  "arise": "To come up from a lower to a higher position.",
  "around": "(with the verb \"to be\") Present in the vicinity.",
  "arrange": "To set up; to organize; to put into an orderly sequence or arrangement.",
  "arrangement": "The act of arranging.",
  "arrest": "A check, stop, an act or instance of arresting something.",
  "arrival": "The act of arriving or something that has arrived.",
  "arrive": "To reach; to get to a certain place.",
  "arrow": "A projectile consisting of a shaft, a point and a tail with stabilizing fins that is shot from a bow.",
  "article": "A piece of nonfictional writing such as a story, report, opinion piece, or entry in a newspaper, magazine, journal, dictionary, encyclopedia, etc.",
  "artist": "A person who creates art.",
  "artwork": "A painting, drawing, sculpture or other piece of creative, visual art",
  "ask": "An act or instance of asking.",
  "aspect": "Any specific feature, part, or element of something.",
  "assert": "An assertion; a section of source code which tests whether an expected condition is true.",
  "assess": "To determine, estimate or judge the value of; to evaluate",
  "asset": "Something or someone of any value; any portion of one's property or effects so considered.",
  "assign": "An assignee.",
  "assist": "A helpful action or an act of giving.",
  "assistant": "Someone who is present; a bystander, a witness.",
  "associate": "A person united with another or others in an act, enterprise, or business; a partner.",
  "association": "The act of associating.",
  "assume": "To authenticate by means of belief; to surmise; to suppose to be true, especially without proof",
  "assumption": "The act of assuming, or taking to or upon oneself; the act of taking up or adopting.",
  "assurance": "The act of assuring; a declaration tending to inspire full confidence; that which is designed to give confidence.",
  "attend": "To listen to (something or someone); to pay attention to; regard; heed.",
  "attention": "Mental focus.",
  "attitude": "The position of the body or way of carrying oneself.",
  "attorney": "A lawyer; one who advises or represents others in legal matters as a profession.",
  "attract": "To pull toward without touching.",
  "auction": "A public event where goods or property are sold to the highest bidder.",
  "audience": "A group of people within hearing; specifically, a large gathering of people listening to or watching a performance, speech, etc.",
  "august": "Awe-inspiring, majestic, noble, venerable.",
  "authority": "The power to enforce rules or give orders.",
  "available": "Such as one may avail oneself of; capable of being used for the accomplishment of a purpose.",
  "avenue": "A broad street, especially one bordered by trees.",
  "average": "The arithmetic mean.",
  "avoid": "To try not to meet or communicate with (a person); to shun",
  "awake": "Not asleep; conscious.",
  "award": "A judgment, sentence, or final decision. Specifically: The decision of arbitrators in a case submitted.",
  "aware": "Vigilant or on one's guard against danger or difficulty.",
  "away": "To depart; to go to another place.",
  "awesome": "Short for awesomeness: the quality, state, or essence of being awesome.",
  "awful": "Very bad.",
  "baby": "A very young human, particularly from birth to a couple of years old or until walking is fully mastered.",
  "back": "The rear of the body, especially the part between the neck and the end of the spine and opposite the chest and belly.",
  "background": "One's social heritage, or previous life; what one did in the past.",
  "backup": "A reserve or substitute.",
  "badge": "A distinctive mark, token, sign, emblem or cognizance, worn on one's clothing, as an insignia of some rank, or of the membership of an organization.",
  "zebra": "An African mammal with distinctive black and white striped coat and maned neck."
}